 HELLO:
   PROCEDURE OPTIONS(MAIN);

   dcl repdsn file record output env(fb, recsize(80), total); 

   dcl sysprint file output;   
   
 END HELLO;

  DCL PARTS          FILE RECORD INPUT ENV(FB,RECSIZE(180),TOTAL);
  DCL SYSPRINT       FILE OUTPUT; 