 INSERT: PROC OPTIONS(MAIN);

   EXEC SQL INCLUDE SQLCA;

   EXEC SQL
   INSERT INTO STUDENT
   (FIRST_NAME,SECOND_NAME,AVG_MARK,GROUP_NUMBER)
   VALUES ('Igor','Egorov',NULL,'1');

   PUT SKIP LIST(SQLCA.SQLCODE);

 END;