   %DECLARE PAYROLL CHARACTER;
   %PAYROLL = 'PAY_ROLL';
   %INCLUDE "included.pli";
   %DEACTIVATE PAYROLL;
   %INCLUDE "included.pli";
   PAY_ROLL = 0; 
   PAYROLL = 1;