 /* Pre-processor declarations & expansion */
 %DECLARE A CHARACTER;
 %A = '123';
 AVERAGE: PROCEDURE OPTIONS (MAIN);
   DCL WHAT FIXED;
   WHAT = A;
 END;
 

