*PROCESS MARGINS(2,120);
 %INCLUDE "b.pli";
 VARB = SYSPARM;
 %INCLUDE C;
 VARC = 3;
 %INCLUDE lib;
 LIBREF = 44;
 %INCLUDE LIB2; // resolves w/out extension
 ABC = 24;