 DCL (A,B,C) FIXED;
 DCL (D, E, F) CHAR;
 DCL G(100) FIXED;
 DCL BITS BIT(32);

 A = ABS(B);
 A = CEIL(B);
 A = COMPLEX(B, C);
 A = CONJG(B);
 A = FLOOR(C);
 A = IMAG(C);
 A = MAX(A, B, C);
 A = MAXVAL(A);
 A = MIN(A, B, C);
 A = MINVAL(A);
 A = MOD(B, C);
 A = RANDOM();
 A = RANDOM(123);
 A = REAL(C);
 A = REM(B, C);
 A = ROUND(B, C);
 A = ROUNDAWAYFROMZERO(B, C);
 A = ROUNDTOEVEN(B, C);
 A = SIGN(-1);
 A = TRUNC(B);
 BITS = ALL(G);
 BITS = ANY(G);
 A = DIMENSION(G, 1);
 A = HBOUND(G, 1);
 A = HBOUNDACROSS(G);
 A = INARRAY(1, G);




