 DCL PROGNAME CHAR(100);
 PROGNAME = 'PROGNAME';
 EXEC CICS LINK PROGRAM(PROGNAME);// COMMAREA(COMA) LENGTH(LENA)
            //DATALENGTH(LENI) SYSID('CONX');