 DCL PROGNAME CHAR(100);
 DCL COMA AREA;
 DCL (LENA, LENI) FIXED;
 EXEC CICS LINK PROGRAM(PROGNAME) COMMAREA(COMA) LENGTH(LENA)
            DATALENGTH(LENI) SYSID(COMA);