 EXEC SQL INCLUDE lib; 
 EXEC SQL INCLUDE SQLDA;
 MAIN: PROCEDURE;
    DECLARE DEPT FIXED;
    EXEC SQL SELECT * FROM employees WHERE department_id = :DEPT;
    DEPT = DEPT + SQRTF(SQLDA.SQLLEN);
 END MAIN;